Repository: tanerci/AgentTest
Catalog: Resources/SharedResource.*.resx
Languages: es_es

source: Invalid username or password
es_es: Nombre de usuario o contraseña inválidos

source: Login successful
es_es: Inicio de sesión exitoso

source: Logout successful
es_es: Cierre de sesión exitoso

# ProductNotFound
source: Product with ID {0} not found
es_es: Producto con ID {0} no encontrado

source: Product deleted successfully
es_es: Producto eliminado exitosamente

# UsernameRequired
source: Username is required
es_es: El nombre de usuario es requerido

# UsernameLength
source: Username must be between 3 and 50 characters
es_es: El nombre de usuario debe tener entre 3 y 50 caracteres

# PasswordRequired
source: Password is required
es_es: La contraseña es requerida

# PasswordLength
source: Password must be between 6 and 100 characters
es_es: La contraseña debe tener entre 6 y 100 caracteres

# ProductNameRequired
source: Product name is required
es_es: El nombre del producto es requerido

# ProductNameLength
source: Product name must be between 1 and 100 characters
es_es: El nombre del producto debe tener entre 1 y 100 caracteres

# ProductDescriptionRequired
source: Product description is required
es_es: La descripción del producto es requerida

# ProductDescriptionMaxLength
source: Product description cannot exceed 500 characters
es_es: La descripción del producto no puede exceder 500 caracteres

# ProductPriceRequired
source: Product price is required
es_es: El precio del producto es requerido

# ProductPriceRange
source: Price must be between 0.01 and 999999.99
es_es: El precio debe estar entre 0.01 y 999999.99

# StockRequired
source: Stock quantity is required
es_es: La cantidad en stock es requerida

# StockRange
source: Stock must be a non-negative number
es_es: El stock debe ser un número no negativo
